example-models/harmonic_oscillator_ode_group_model/readme.org
* Description
Parameter inference for the harmonic oscillator ODE using
Torsten's ODE group integrator =pmx_integrate_ode_group_rk45=.
* Build
** Edit/Add =cmdstan/make/local=
#+BEGIN_SRC sh
  TORSTEN_MPI = 1                                         # flag on torsten's MPI solvers
  -include $(MATH)make/setup_torsten.mk
  CXXFLAGS += $(CXXFLAGS_MPI) -isystem /usr/local/include # path to MPI library's headers
  LDFLAGS += $(LDFLAGS_MPI)
  CC=mpicxx                                               # name of mpi compilers
  CXX=mpicxx
#+END_SRC
** Build in =cmdstan=
#+BEGIN_SRC sh
  make ../example-models/harmonic_oscillator_ode_group_model/sho_group
#+END_SRC
   
* Run
#+BEGIN_SRC sh
mpiexec -n 2 sho_group sample data file=sho_group.data.R
#+END_SRC

* Results
Three chains are run using 
- sequential run using Stan's =bdf= integrator.
- sequential run using Torsten's =bdf= integrator.
- MPI run using Torsten's =bdf= group integrator(with 1, 2,
  4, 8, 16 processes, respectively).

The wall time of sequential runs and MPI runs(in seconds)
with ODE group size 4
#+caption: Wall time(s)
| run                 | wall time(s) |
|---------------------+--------------|
| Sequential stan     |          39 |
| sequential pmx      |          33 |
| MPI pmx (n_proc=1)  |          34  |
| MPI pmx (n_proc=2)  |          18  |
| MPI pmx (n_proc=4)  |          10  |


The wall time of sequential runs and MPI runs(in seconds)
with ODE group size 20
#+caption: Wall time(s)
| run                 | wall time(s) |
|---------------------+--------------|
| Sequential stan     |          262 |
| sequential pmx      |          276 |
| MPI pmx (n_proc=1)  |          253 |
| MPI pmx (n_proc=2)  |          119 |
| MPI pmx (n_proc=4)  |           62 |
| MPI pmx (n_proc=8)  |           74 |
| MPI pmx (n_proc=16) |           58 |


